## staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 10 to add, 16 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                    NAME                                     |
|----------|-----------------------------------------------------------------------------|
| add      | `module.cbs_logs_bucket[0].aws_s3_bucket.this`                              |
|          | `module.cbs_logs_bucket[0].aws_s3_bucket_acl.this`                          |
|          | `module.cbs_logs_bucket[0].aws_s3_bucket_ownership_controls.this`           |
|          | `module.cbs_logs_bucket[0].aws_s3_bucket_policy.this`                       |
|          | `module.cbs_logs_bucket[0].aws_s3_bucket_public_access_block.this`          |
|          | `module.cbs_logs_bucket[0].aws_s3_bucket_versioning.this`                   |
| update   | `aws_s3_bucket.alb_log_bucket`                                              |
|          | `aws_s3_bucket.asset_bucket`                                                |
|          | `aws_s3_bucket.athena_bucket`                                               |
|          | `aws_s3_bucket.csv_bucket`                                                  |
|          | `aws_s3_bucket.document_bucket`                                             |
|          | `aws_s3_bucket.scan_files_document_bucket`                                  |
|          | `module.athena_logs_bucket.aws_s3_bucket.this`                              |
|          | `module.athena_logs_bucket.aws_s3_bucket_policy.this`                       |
|          | `module.csv_bucket_logs.aws_s3_bucket.this`                                 |
|          | `module.csv_bucket_logs.aws_s3_bucket_policy.this`                          |
|          | `module.document_download_logs.aws_s3_bucket.this`                          |
|          | `module.document_download_logs.aws_s3_bucket_policy.this`                   |
|          | `module.sns_sms_usage_report_bucket.aws_s3_bucket.this`                     |
|          | `module.sns_sms_usage_report_bucket_us_west_2.aws_s3_bucket.this`           |
|          | `module.sns_sms_usage_report_sanitized_bucket.aws_s3_bucket.this`           |
|          | `module.sns_sms_usage_report_sanitized_bucket_us_west_2.aws_s3_bucket.this` |
| recreate | `module.notify_slack_critical.module.lambda.null_resource.archive[0]`       |
|          | `module.notify_slack_general.module.lambda.null_resource.archive[0]`        |
|          | `module.notify_slack_ok.module.lambda.null_resource.archive[0]`             |
|          | `module.notify_slack_warning.module.lambda.null_resource.archive[0]`        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_s3_bucket.alb_log_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "alb_log_bucket" {
      ~ force_destroy               = false -> true
        id                          = "notification-canada-ca-staging-alb-logs"
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket.asset_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "asset_bucket" {
      ~ force_destroy               = false -> true
        id                          = "notification-canada-ca-staging-asset-upload"
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.athena_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "athena_bucket" {
      ~ force_destroy               = false -> true
        id                          = "notification-canada-ca-staging-athena"
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (13 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_s3_bucket.csv_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "csv_bucket" {
      ~ force_destroy               = false -> true
        id                          = "notification-canada-ca-staging-csv-upload"
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (13 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_s3_bucket.document_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "document_bucket" {
      ~ force_destroy               = false -> true
        id                          = "notification-canada-ca-staging-document-download"
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (13 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # aws_s3_bucket.scan_files_document_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "scan_files_document_bucket" {
      ~ force_destroy               = false -> true
        id                          = "notification-canada-ca-staging-document-download-scan-files"
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (13 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.athena_logs_bucket.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.athena_logs_bucket.data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deny_insecure_transport" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::notification-canada-ca-staging-athena-logs",
              + "arn:aws:s3:::notification-canada-ca-staging-athena-logs/*",
            ]
          + sid       = "denyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.athena_logs_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
      ~ force_destroy               = false -> true
        id                          = "notification-canada-ca-staging-athena-logs"
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
            "CostCentre" = "notification-canada-ca-staging"
            "Critical"   = "true"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.athena_logs_bucket.aws_s3_bucket_policy.this will be updated in-place
  ~ resource "aws_s3_bucket_policy" "this" {
        id     = "notification-canada-ca-staging-athena-logs"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::notification-canada-ca-staging-athena-logs/*",
                          - "arn:aws:s3:::notification-canada-ca-staging-athena-logs",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.cbs_logs_bucket[0].data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.cbs_logs_bucket[0].data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "denyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.cbs_logs_bucket[0].data.aws_iam_policy_document.elb_log_delivery[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "elb_log_delivery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSELBLogDeliveryWrite"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::985666609251:root",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.cbs_logs_bucket[0].data.aws_iam_policy_document.lb_log_delivery[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lb_log_delivery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSLogDeliveryWrite"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "bucket-owner-full-control",
                ]
              + variable = "s3:x-amz-acl"
            }

          + principals {
              + identifiers = [
                  + "delivery.logs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSLogDeliveryAclCheck"

          + principals {
              + identifiers = [
                  + "delivery.logs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "cbs-satellite-239043911459"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "CostCentre" = "notification-canada-ca-staging"
          + "Critical"   = "true"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "CostCentre" = "notification-canada-ca-staging"
          + "Critical"   = "true"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 90
            }
        }

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "log-delivery-write"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket_ownership_controls.this will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.cbs_logs_bucket[0].aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.csv_bucket_logs.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.csv_bucket_logs.data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deny_insecure_transport" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::notification-canada-ca-staging-csv-upload-logs",
              + "arn:aws:s3:::notification-canada-ca-staging-csv-upload-logs/*",
            ]
          + sid       = "denyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.csv_bucket_logs.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
      ~ force_destroy               = false -> true
        id                          = "notification-canada-ca-staging-csv-upload-logs"
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
            "CostCentre" = "notification-canada-ca-staging"
            "Critical"   = "true"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.csv_bucket_logs.aws_s3_bucket_policy.this will be updated in-place
  ~ resource "aws_s3_bucket_policy" "this" {
        id     = "notification-canada-ca-staging-csv-upload-logs"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::notification-canada-ca-staging-csv-upload-logs/*",
                          - "arn:aws:s3:::notification-canada-ca-staging-csv-upload-logs",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.document_download_logs.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.document_download_logs.data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deny_insecure_transport" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::notification-canada-ca-staging-document-download-logs",
              + "arn:aws:s3:::notification-canada-ca-staging-document-download-logs/*",
            ]
          + sid       = "denyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.document_download_logs.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
      ~ force_destroy               = false -> true
        id                          = "notification-canada-ca-staging-document-download-logs"
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
            "CostCentre" = "notification-canada-ca-staging"
            "Critical"   = "true"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.document_download_logs.aws_s3_bucket_policy.this will be updated in-place
  ~ resource "aws_s3_bucket_policy" "this" {
        id     = "notification-canada-ca-staging-document-download-logs"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::notification-canada-ca-staging-document-download-logs/*",
                          - "arn:aws:s3:::notification-canada-ca-staging-document-download-logs",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.sns_sms_usage_report_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
      ~ force_destroy               = false -> true
        id                          = "notification-canada-ca-staging-sms-usage-logs"
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
            "CostCentre" = "notification-canada-ca-staging"
            "Critical"   = "false"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sns_sms_usage_report_bucket_us_west_2.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
      ~ force_destroy               = false -> true
        id                          = "notification-canada-ca-staging-sms-usage-west-2-logs"
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
            "CostCentre" = "notification-canada-ca-staging"
            "Critical"   = "false"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sns_sms_usage_report_sanitized_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
      ~ force_destroy               = false -> true
        id                          = "notification-canada-ca-staging-sms-usage-logs-san"
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
            "CostCentre" = "notification-canada-ca-staging"
            "Critical"   = "false"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sns_sms_usage_report_sanitized_bucket_us_west_2.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
      ~ force_destroy               = false -> true
        id                          = "notification-canada-ca-staging-sms-usage-west-2-logs-san"
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
            "CostCentre" = "notification-canada-ca-staging"
            "Critical"   = "false"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.notify_slack_critical.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4343283993432098235" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "<WARNING: Missing lambda zip artifacts wouldn't be restored>" -> "1726256262522825000"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_general.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8065581048293872297" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "<WARNING: Missing lambda zip artifacts wouldn't be restored>" -> "1726256255416794000"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_ok.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5799159728241661225" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "<WARNING: Missing lambda zip artifacts wouldn't be restored>" -> "1726256262432262000"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_warning.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3493195851672287646" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "<WARNING: Missing lambda zip artifacts wouldn't be restored>" -> "1726256262544606000"
            # (1 unchanged element hidden)
        }
    }

Plan: 10 to add, 16 to change, 4 to destroy.

Changes to Outputs:
  ~ cbs_satellite_bucket_name                           = "" -> "cbs-satellite-239043911459"

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 67 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.ad_hoc"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.build_tables"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.support"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.notify_global"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning[0]"]
WARN - plan.json...
```

</details>
